# create index

In [1]:
import pandas as pd

cell_data = pd.read_csv("cell_subs_2011.csv")  # load data
cell_data

   Unnamed: 0         country  year  cellular_subscriptions
0           0        Bulgaria  2011                10475083
1           1         Denmark  2011                 7047000
2           2         Romania  2011                23400000
3           3          Russia  2011               256116581
4           4  United Kingdom  2011                81612000

In [2]:
cell_data = pd.read_csv("cell_subs_2011.csv", index_col = 0)  # creates index of specified column
cell_data

          country  year  cellular_subscriptions
0        Bulgaria  2011                10475083
1         Denmark  2011                 7047000
2         Romania  2011                23400000
3          Russia  2011               256116581
4  United Kingdom  2011                81612000

In [3]:
cell_data.index = ["BG", "DK", "RO", "RU", "GB"]  # use .idex to change row (aka index)  labels
cell_data

           country  year  cellular_subscriptions
BG        Bulgaria  2011                10475083
DK         Denmark  2011                 7047000
RO         Romania  2011                23400000
RU          Russia  2011               256116581
GB  United Kingdom  2011                81612000

In [4]:
# Temporarily change index to a specified column

cell_data.set_index("country")  # use .set_index to set idex manually to one of the columns temporaraly.  for permanent use inplace = True

                year  cellular_subscriptions
country
Bulgaria        2011                10475083
Denmark         2011                 7047000
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

In [5]:
cell_data

           country  year  cellular_subscriptions
BG        Bulgaria  2011                10475083
DK         Denmark  2011                 7047000
RO         Romania  2011                23400000
RU          Russia  2011               256116581
GB  United Kingdom  2011                81612000

In [6]:
#PErmanently change index

cell_data.set_index("country", inplace = True)
cell_data

                year  cellular_subscriptions
country
Bulgaria        2011                10475083
Denmark         2011                 7047000
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

In [7]:
cell_data

                year  cellular_subscriptions
country
Bulgaria        2011                10475083
Denmark         2011                 7047000
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

# select data

# Rows = slicing

In [8]:
# select all rows by slicing

cell_data[:]

                year  cellular_subscriptions
country
Bulgaria        2011                10475083
Denmark         2011                 7047000
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

In [9]:
# select first two rows

cell_data[:2]

          year  cellular_subscriptions
country
Bulgaria  2011                10475083
Denmark   2011                 7047000

In [10]:
# select rows from the third to the end

cell_data[2:]

                year  cellular_subscriptions
country
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

In [11]:
# select only second row

cell_data[1:2]

         year  cellular_subscriptions
country
Denmark  2011                 7047000

# columns = lists

In [12]:
# select a specific column

cell_data["cellular_subscriptions"]  # includes index, index not selectable seperatley

country
Bulgaria           10475083
Denmark             7047000
Romania            23400000
Russia            256116581
United Kingdom     81612000
Name: cellular_subscriptions, dtype: int64

In [13]:
# select more thasn one column

cell_data[["cellular_subscriptions", "year"]]  # can put in specific order

                cellular_subscriptions  year
country
Bulgaria                      10475083  2011
Denmark                        7047000  2011
Romania                       23400000  2011
Russia                       256116581  2011
United Kingdom                81612000  2011

# columns and rows

In [14]:
# loc uses row labels on left side, column labels on right side
# iloc uses integer position

cell_data.loc["Bulgaria"] # only specify index labelgive all info for that observation

year                          2011
cellular_subscriptions    10475083
Name: Bulgaria, dtype: int64

In [15]:
# use one [] to select as a series

cell_data.iloc[0] #only specify left side gives you all info for that row

year                          2011
cellular_subscriptions    10475083
Name: Bulgaria, dtype: int64

In [16]:
# use double [[]] to select row as dataframe

cell_data.iloc[[0]]

          year  cellular_subscriptions
country
Bulgaria  2011                10475083

In [17]:
# select two rows as dataframe

cell_data.iloc[[0, 2]]  # selects first two rows

          year  cellular_subscriptions
country
Bulgaria  2011                10475083
Romania   2011                23400000

In [18]:
# select two rows and two columns

cell_data.iloc[[3, 4], [0, 1]]  # selects third and fourth row and first and second column. exludes index

                year  cellular_subscriptions
country
Russia          2011               256116581
United Kingdom  2011                81612000

In [19]:
# select all rows and specific colunms

cell_data.iloc[:, [0, 1]]  # use : with no brackets to select all rows

                year  cellular_subscriptions
country
Bulgaria        2011                10475083
Denmark         2011                 7047000
Romania         2011                23400000
Russia          2011               256116581
United Kingdom  2011                81612000

In [20]:
# select all columns and specific rows

cell_data.iloc[[0, 3, 1], :]  # selects first row (0), fourth row (3), and second row (2)

          year  cellular_subscriptions
country
Bulgaria  2011                10475083
Russia    2011               256116581
Denmark   2011                 7047000

# comparison operators

In [21]:
# Numbers Comparisons
age = 18
print(age < 18)  # False less than
print(age <= 19) # True less than or equal to
print(age > 20)  # False greater than
print(age >= 18) # True  greater than or equal to
print(age == 18) # True "==" equal
print(age != 18) # False "!=" Not equal

print(4 < 4.1)     # True
print(4 < 4.0)     # False
print(4 == 4.0)    # True
print(4 * 5 == 20) # True

False
True
False
True
True
False
True
False
True
True

In [22]:
# Strings comparisons
print("Python" == "python") # False
print("Python" > "C#")      # True
print("Data" != "Data")     # False

False
True
False

In [23]:
# Boolean comparisons
print(True == False)  # False
print(False == False) # True
print(True == True)   # True
print(True > False)   # True

False
True
True
True

In [24]:
# Comparing different types
print(True == 1)  # True
print(False == 0) # True
print(False == 1) # False
print(True == 0)  # False

True
True
False
False

# Filtering data frame

In [25]:
cell_data = pd.read_csv("cell_subs_2011.csv", index_col = 0)  # creates index of specified column
cell_data.index = ["BG", "DK", "RO", "RU", "GB"]
cell_data

           country  year  cellular_subscriptions
BG        Bulgaria  2011                10475083
DK         Denmark  2011                 7047000
RO         Romania  2011                23400000
RU          Russia  2011               256116581
GB  United Kingdom  2011                81612000

In [26]:
# creating a boolean series.
# DataFrame[column_name] and DataFrame.column_name code blocks returns the same result

#our filter
small_subs = cell_data.cellular_subscriptions < 11000000  # creates boolean series for cellular_subscriptions colums

# Print the type of the variable
print(type(small_subs))

# Return Resluts
small_subs

<class 'pandas.core.series.Series'>

BG     True
DK     True
RO    False
RU    False
GB    False
Name: cellular_subscriptions, dtype: bool

In [27]:
# filtering the data using boolean example above

cell_data[small_subs]

     country  year  cellular_subscriptions
BG  Bulgaria  2011                10475083
DK   Denmark  2011                 7047000

In [28]:
# get all records where colums is specific type

uk = cell_data.country == "United Kingdom"  # column country and all rows equal to united kingdom
cell_data[uk]

           country  year  cellular_subscriptions
GB  United Kingdom  2011                81612000

# Boolean Operators

In [29]:
# simple booloean operations

weight = 75
print(weight < 80 or weight > 100)  # True return True if at least one of them is True
print(weight < 70 or weight > 100)  # False
print(weight > 70 and weight < 74)  # False
print(weight > 70 and weight < 76)  # True if both the values are True
print(not weight == 75)             # False return the opposite

True
False
False
True
False

# Subsetting by Multiple Conditions

In [30]:
# & for and
# | for or
# ~ for not

# using and operator

flight_data = pd.read_csv("flight_data.csv")


greater_than_240 = flight_data.passengers > 240
lower_than_300 = flight_data.passengers < 300  # create filter from flight_data column passangers less than 300
all_filters = greater_than_240 & lower_than_300  # use & instead of and in pandas
flight_data[all_filters]  # flights that have more than 240 passengers and less than 300 passengers.

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293

In [31]:
# using or operator

few_passengers = flight_data.passengers < 200
many_passengers = flight_data.passengers > 375
both_filters = few_passengers | many_passengers # use | for or operator
flight_data[both_filters]

   year     month  passengers
0  1952  November         172
7  1959     April         396
8  1959   October         407
9  1960  November         390

In [32]:
# reversing conditions using not operator


november_filter = flight_data.month == "November"
flight_data[~november_filter]  # to get all flights that the month is not November.

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293
5  1955   February         233
6  1957   February         301
7  1959      April         396
8  1959    October         407

In [33]:
# complex filter using specific conditions

is_november = flight_data.month == "November"
years_filter = (flight_data.year == 1952) | (flight_data.year == 1954)
new_filters =  is_november & years_filter
flight_data[new_filters]  # get all flights that in November for the 1952 and 1954 years.

   year     month  passengers
0  1952  November         172
2  1954  November         203

In [34]:
# more complex filters

years_filter = (flight_data.year >= 1952) | (flight_data.year <= 1954)
month_filter = (flight_data.month == "August") | (flight_data.month == "September")
all_filters = years_filter & month_filter
flight_data[all_filters]  # all flights that are between the 1952 and 1954 years and the month is August or September.

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293

In [35]:
# The isin method

months_filter = ((flight_data.month == "February") |
                 (flight_data.month == "August") |
                 (flight_data.month == "September"))
flight_data[months_filter]  # to get all flights that are in the months: February, August, and September using or | condition

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293
5  1955   February         233
6  1957   February         301

In [36]:
# better way using isin method

months_filter = flight_data.month.isin(["February", "August", "September"])
flight_data[months_filter]

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293
5  1955   February         233
6  1957   February         301

In [37]:
# combine with other methods

months_filter = flight_data.month.isin(["February", "August", "September"])
years_filter = flight_data.year == 1954
all_filters= months_filter & years_filter
flight_data[all_filters]  #  to get the flights that are in the 1954 year and in the February, August, and September months.Notice Febraury has no flights in 1954

   year      month  passengers
3  1954  September         259
4  1954     August         293

In [38]:
# the two bolloean vs. between method to select values inside in a range

year_filter = (flight_data.year >= 1955) & (flight_data.year <= 1960)
flight_data[year_filter]  # to get all flights between the 1955 and 1960 years inclusive.

   year     month  passengers
5  1955  February         233
6  1957  February         301
7  1959     April         396
8  1959   October         407
9  1960  November         390

In [39]:
# between operator is better than above method!

years_filter = flight_data.year.between(1955, 1960)
flight_data[years_filter]

   year     month  passengers
5  1955  February         233
6  1957  February         301
7  1959     April         396
8  1959   October         407
9  1960  November         390

In [40]:
# combining between method

years_filter = flight_data.year.between(1955, 1960)
months_filter = flight_data.month == "October"
all_filters = years_filter & months_filter
flight_data[all_filters]  # all the flights that are between the 1955 and 1960 years and are in the October month.

   year    month  passengers
8  1959  October         407

# isnull and isna methods

In [41]:
# get all the records which have a missing month.
# isnull and isna operator do same thing

flight_data_nan = pd.read_csv("flight_data_nan.csv")

miss_month = flight_data_nan.month.isnull()  # speify column want to searech for nan values
flight_data_nan[miss_month]

   year month  passengers
0  1952   NaN         172
2  1954   NaN         203
7  1959   NaN         396
8  1959   NaN         407
9  1960   NaN         390

In [42]:
# get the flights that have no missing month.

flight_data_nan[~miss_month]  # use the not operator with the ~ character to negate the Boolean series

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293
5  1955   February         233
6  1957   February         301

# The notna method

In [43]:
# similar to using the not ~ symbol above use notna() operator

not_miss_month = flight_data_nan.month.notna()
flight_data_nan[not_miss_month]

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293
5  1955   February         233
6  1957   February         301

# Subsetting by a Condition in One Line

In [44]:
# filter in one line of code 
#example only with one condition

flight_data[flight_data.month == "November"]  # uses only one line of code to get novemeber

   year     month  passengers
0  1952  November         172
2  1954  November         203
9  1960  November         390

# Subsetting by Multiple Conditions in One Line

In [45]:
# find flight data for passengers greater than 240 but less thatn 300

flight_data[(flight_data.passengers > 240) & (flight_data.passengers < 300)]

   year      month  passengers
1  1953     August         272
3  1954  September         259
4  1954     August         293

In [46]:
# find flight data betwwen 1952 and 1954 in november

flight_data[(flight_data.year.between(1952, 1954)) & (flight_data.month == "November")]

   year     month  passengers
0  1952  November         172
2  1954  November         203

In [47]:
# find flight data in april and august with less than 275 passengers

flight_data[(flight_data.month.isin(["April", "August"])) & (flight_data.passengers > 275)]

   year   month  passengers
4  1954  August         293
7  1959   April         396

# Subsetting with boolean series using the .loc method

In [48]:
# using .loc to find data for flights greater than 1957

select_rows = flight_data.year > 1957
flight_data.loc[select_rows]

   year     month  passengers
7  1959     April         396
8  1959   October         407
9  1960  November         390

In [49]:
select_columns = ["month", "passengers"]
select_rows = flight_data.year > 1957
flight_data.loc[select_rows, select_columns]

      month  passengers
7     April         396
8   October         407
9  November         390

In [50]:
select_colums = ["year", "passengers"]
select_rows = flight_data.month == "November"
flight_data.loc[select_rows, select_columns]

      month  passengers
0  November         172
2  November         203
9  November         390